# Cask tap
tap 'teamookla/speedtest'
tap 'ankitpokhrel/jira-cli'

# Zsh
brew 'zsh'
brew 'zsh-autocomplete'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'bat'
brew 'fzf'
brew 'fd'
brew 'zoxide'
brew 'delta'
brew 'dateutils'
brew 'powerlevel10k'
brew 'pygments'

# Tmux
brew 'tmux'
brew 'tmuxp'

# Tools
brew 'coreutils'
brew 'git'
brew 'pandoc'
brew 'tree'
brew 'pdfgrep'
brew 'pdftotext'
brew 'eza'
brew 'ncdu'
brew 'defaultbrowser'

# Development
brew 'emacs'
brew 'pyenv'
cask 'cursor'

# Work + Sync
cask 'zoom'
cask 'google-drive'

# Menubar
cask 'mac2imgur'
cask '1password'
cask 'itsycal'
cask 'tiles'
cask 'displaperture'
cask 'hiddenbar'

# Academic
# cask 'mactex-no-gui'
# cask 'papers'
# cask 'mendeley'

# Audio & Video
cask 'vlc'
cask 'imageoptim'
cask 'blackhole-16ch'
cask 'audacity'

# Applications
cask 'firefox'
cask 'notion'
cask 'whatsapp'
cask 'messenger'

# Work
brew 'jira-cli'
