# Cask tap
tap 'caskroom/cask'

# Shells
brew 'zsh'

# Tools
brew 'coreutils'
brew 'git'
brew 'pandoc'
brew 'tree'
brew 'screenbrightness'
brew 'heroku-toolbelt'

# Languages
brew 'fpc'
brew 'node'
brew 'rbenv'
brew 'ruby-build'

# Docker
brew 'docker'
brew 'docker-compose'
brew 'docker-machine'

# Basic software
cask 'dropbox'
cask 'macdown'
cask 'flux'
cask 'slack'
cask 'messenger-for-desktop'
cask 'flash'
cask 'evernote'
cask 'vlc'
cask 'mac2imgur'
cask 'mendeley-desktop'

# Virtual Machine
cask 'vmware-fusion'
cask 'virtualbox'

# Browsers
cask 'google-chrome'
cask 'firefox'

# Editors
cask 'visual-studio-code'
cask 'sketch'

# Fun
brew 'fortune'
