# Cask tap
tap 'caskroom/cask'
tap 'teamookla/speedtest'

# Shells
brew 'zsh'

# Tools
brew 'coreutils'
brew 'git'
brew 'pandoc'
brew 'tree'
brew 'blueutil'

# Development
brew 'rbenv'
brew 'pyenv'
brew 'ruby-build'
cask 'visual-studio-code'

# Work + Sync
cask 'slack'
cask 'microsoft-outlook' # needed until new version is out
cask 'zoomus'
cask 'google-backup-and-sync'
cask 'google-drive-file-stream'

# Software
cask 'mactex-no-gui'
cask 'macdown'
cask 'vlc'
cask 'mac2imgur'
cask 'imageoptim'
cask 'papers'
cask 'firefox'
cask 'fluid'
cask 'omnidisksweeper'
cask '1password'
cask 'mendeley'
cask 'itsycal'
cask 'tiles'
cask 'speedtest'
