# Cask tap
tap 'teamookla/speedtest'

# Shells
brew 'zsh'

# Tools
brew 'coreutils'
brew 'git'
brew 'pandoc'
brew 'tree'
cask 'fig' 
brew 'pdfgrep'
#brew 'blueutil'

# Development
brew 'emacs'
brew 'rbenv'
brew 'pyenv'
brew 'ruby-build'
cask 'visual-studio-code'

# Work + Sync
#cask 'slack'
#cask 'microsoft-outlook' # needed until new version is out
cask 'zoom'
cask 'google-drive'

# Menubar
cask 'mac2imgur'
cask '1password'
cask 'itsycal'
cask 'tiles'
cask 'displaperture'
cask 'hiddenbar'
cask 'xbar'

# Academic
# cask 'mactex-no-gui'
# cask 'papers'
# cask 'mendeley'

# Audio & Video
cask 'vlc'
cask 'imageoptim'
cask 'blackhole-16ch'
cask 'audacity'

# Applications
cask 'firefox'
cask 'notion'
cask 'whatsapp'
cask 'messenger'
